Revit 2027 API
CurveElementFilter Constructor
Overload List
Name | Description
CurveElementFilter(CurveElementType) |  Constructs a new instance of a filter to match specific types of curve elements.
CurveElementFilter(CurveElementType, Boolean) |  Constructs a new instance of a filter to match specific types of curve elements, with the option to match all curves which are not of the given curve type.
Top
See Also
Reference
CurveElementFilter Class
Autodesk.Revit.DB Namespace